royh99/Stm32f1-vcu/src/stm32_vcu_5_5_24.cpp
/*
 * This file is part of the ZombieVerter project.
 *
 * Copyright (C) 2010 Johannes Huebner <contact@johanneshuebner.com>
 * Copyright (C) 2010 Edward Cheeseman <cheesemanedward@gmail.com>
 * Copyright (C) 2009 Uwe Hermann <uwe@hermann-uwe.de>
 * Copyright (C) 2019-2022 Damien Maguire <info@evbmw.com>
 *
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program.  If not, see <http://www.gnu.org/licenses/>.
 */
#include "stm32_vcu.h"

extern "C" void __cxa_pure_virtual()
{
    while (1);
}

static Stm32Scheduler* scheduler;
static bool chargeMode = false;
static bool chargeModeDC = false;
static bool chgLck = false;
static CanHardware* canInterface[2];
static CanMap* canMap;
static ChargeModes targetCharger;
static ChargeInterfaces targetChgint;
static uint8_t chgSet;
static bool runChg;
static uint8_t chgHrs_tmp;
static uint8_t chgMins_tmp;
static uint16_t chgDur_tmp;
static uint32_t chgTicks=0,chgTicks_1Min=0;
static bool startSig=false;
static bool ACrequest=false;
static bool initbyStart=false;
static bool initbyCharge=false;


static volatile unsigned
days=0,
hours=0, minutes=0, seconds=0,
alarm=0; // != 0 when alarm is pending

static uint8_t rlyDly=25;

// Instantiate Classes
static Can_LR lrVehicle;
static NoVehicle novehicle;
static notused UnUsed;
static noCharger nochg;
static outlanderCharger outChg;
static FCChademo chademoFC;
static OutlanderInverter outlanderInv;
static noHeater Heaternone;
static NoVehicle VehicleNone;
static Inverter* selectedInverter = &outlanderInv;
static Vehicle* selectedVehicle = &lrVehicle;
static Heater* selectedHeater = &Heaternone;
static Chargerhw* selectedCharger = &outChg;
static Chargerint* selectedChargeInt = &UnUsed;
static BMS BMSnone;
static SimpBMS BMSsimp;
static DCDC DCDCnone;
static outlanderDCDC DCDCoutlander;
static BMS* selectedBMS = &BMSnone;
static DCDC* selectedDCDC = &DCDCnone;
static Can_OBD2 canOBD2;
static LinBus* lin;


///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
static void Ms200Task(void)
{
    int opmode = Param::GetInt(Param::opmode);
    DigIo::led_rd.Toggle();
    selectedVehicle->Task200Ms();
    if(opmode==MOD_CHARGE) selectedCharger->Task200Ms();

    Param::SetInt(Param::Day,days);
    Param::SetInt(Param::Hour,hours);
    Param::SetInt(Param::Min,minutes);
    Param::SetInt(Param::Sec,seconds);
    Param::SetInt(Param::ChgTime,chgDur_tmp);
    if(chgSet==2 && !chgLck)  //if in timer mode and not locked out from a previous full charge.
    {
        if(opmode!=MOD_CHARGE)
        {
            if((chgHrs_tmp==hours)&&(chgMins_tmp==minutes)&&(chgDur_tmp!=0))runChg=true;//if we arrive at set charge time and duration is non zero then initiate charge
            else runChg=false;
        }

        if(opmode==MOD_CHARGE)
        {
            if(chgTicks!=0)
            {
                chgTicks--; //decrement charge timer ticks
                chgTicks_1Min++;
            }

            if(chgTicks==0)
            {
                runChg=false; //end charge if still charging once timer expires.
                chgTicks = (GetInt(Param::Chg_Dur)*300);//recharge the tick timer
            }

            if (chgTicks_1Min==300)
            {
                chgTicks_1Min=0;
                chgDur_tmp--; //countdown minutes of charge time remaining.
            }
        }

    }
    if(chgSet==0 && !chgLck) runChg=true;//enable from webui if we are not locked out from an auto termination
    if(chgSet==1) runChg=false;//disable from webui

    //Handle PP on the Charging port
    if(Param::GetInt(Param::GPA1Func) == IOMatrix::PILOT_PROX)
    {
        int ppThresh = Param::GetInt(Param::ppthresh);

        int ppValue = IOMatrix::GetAnaloguePin(IOMatrix::PILOT_PROX)->Get();
        Param::SetInt(Param::PPVal, ppValue);


        //if PP is less than threshold and currently disabled and not already finished
        if (ppValue < ppThresh && chgSet==1 && !chgLck)
        {
            runChg=true;
        }
        else if (ppValue > ppThresh)
        {
            //even if timer was enabled, change to disabled, we've unplugged
            runChg=false;
        }
    }

    if(selectedCharger->ControlCharge(runChg, ACrequest) && (opmode != MOD_RUN))
    {
        chargeMode = true;   //AC charge mode
        Param::SetInt(Param::chgtyp,AC);
    }
    else if(!chargeModeDC)
    {
        Param::SetInt(Param::chgtyp,OFF);
        chargeMode = false;  //no charge mode
    }

    //in chademo , we do not want to run the 200ms task unless in dc charge mode
    if(targetChgint == ChargeInterfaces::Chademo && chargeModeDC) selectedChargeInt->Task200Ms();
    //and just to be thorough ...
    if(targetChgint == ChargeInterfaces::Unused) selectedChargeInt->Task200Ms();



    ///////////////////////////////////////
    //Charge term logic for AC charge
    ///////////////////////////////////////
    /*
    if we are in charge mode and battV >= setpoint and power is <= termination setpoint
        Then we end charge.
    */
    if(opmode==MOD_CHARGE && !chargeModeDC)
    {
        if(Param::GetFloat(Param::udc)>=Param::GetFloat(Param::Voltspnt) && Param::GetFloat(Param::idc)<=Param::GetFloat(Param::IdcTerm))
        {
            runChg=false;//end charge
            chgLck=true;//set charge lockout flag
        }
        
        if(selectedBMS->MaxChargeCurrent()==0)//BMS can command an AC charge shutdown if its current limit is 0
        {
            runChg=false;//end charge
            chgLck=true;//set charge lockout flag
        }
        
        
