royh99/Stm32f1-vcu/src/stm32_vcu_5_5_24.cpp
    }
    if(opmode==MOD_RUN)
    {
        chgLck=false;//reset charge lockout flag when we drive off
        
        //Brake Vac Sensor
        if(Param::GetInt(Param::GPA1Func) == IOMatrix::VAC_SENSOR)
       {
            int brkVacThresh = Param::GetInt(Param::BrkVacThresh);
            int BrkVacHyst = Param::GetInt(Param::BrkVacHyst);

            int brkVacVal = IOMatrix::GetAnaloguePin(IOMatrix::VAC_SENSOR)->Get();
            Param::SetInt(Param::BrkVacVal, brkVacVal);

            // if brkVacThresh > BrkVacHyst then sensor reads higher with more vacuum else other way round
            if (brkVacThresh > BrkVacHyst)
            {
                //enable pump
                if (brkVacVal > brkVacThresh)
                {
                    IOMatrix::GetPin(IOMatrix::BRAKEVACPUMP)->Clear();
                }
                else if (brkVacVal < BrkVacHyst)
                {
                    IOMatrix::GetPin(IOMatrix::BRAKEVACPUMP)->Set();
                }
            }
            else
            {
                //enable pump
                if (brkVacVal < brkVacThresh)
                {
                    IOMatrix::GetPin(IOMatrix::BRAKEVACPUMP)->Clear();
                }
                else if (brkVacVal > BrkVacHyst)
                {
                    IOMatrix::GetPin(IOMatrix::BRAKEVACPUMP)->Set();
                }
            }
        }
    }
    else
    {
        IOMatrix::GetPin(IOMatrix::BRAKEVACPUMP)->Clear();  
    }
    
    //dac_load_data_buffer_single(Param::GetInt(Param::DAC1), RIGHT12, CHANNEL_1);
    //dac_software_trigger(CHANNEL_1);
    //dac_load_data_buffer_single(Param::GetInt(Param::DAC2), RIGHT12, CHANNEL_2);
    //dac_software_trigger(CHANNEL_2);
    
}

uint8_t i = 0;

static void Ms100Task(void)
{
    /*    
        if (i < 115) 
        {
        dac_load_data_buffer_single(400+(i*32), RIGHT12, CHANNEL_1);
        dac_software_trigger(CHANNEL_1);  
        dac_load_data_buffer_single(200+(i*16), RIGHT12, CHANNEL_2);
        dac_software_trigger(CHANNEL_2);
        i++;
        }
        if (i >= 115) 
        {
        dac_load_data_buffer_single(400+((228-i)*32), RIGHT12, CHANNEL_1);
        dac_software_trigger(CHANNEL_1);  
        dac_load_data_buffer_single(200+((228-i)*16), RIGHT12, CHANNEL_2);
        dac_software_trigger(CHANNEL_2);
        i++;
        }
        if (i==229) i=0;
    */    
    DigIo::led_out.Toggle();
    iwdg_reset();
    float cpuLoad = scheduler->GetCpuLoad() / 10.0f;
    Param::SetFloat(Param::cpuload, cpuLoad);
    Param::SetInt(Param::lasterr, ErrorMessage::GetLastError());
    int opmode = Param::GetInt(Param::opmode);
    utils::SelectDirection(selectedVehicle);
    utils::CalcSOC();
       
    selectedInverter->Task100Ms();
    selectedVehicle->Task100Ms();
    selectedCharger->Task100Ms();
    selectedBMS->Task100Ms();
    selectedDCDC->Task100Ms();
    //selectedShifter->Task100Ms();
    canMap->SendAll();

    if (Param::GetInt(Param::dir) < 0)
    {
        IOMatrix::GetPin(IOMatrix::REVERSELIGHT)->Set();
    }
    else
    {
        IOMatrix::GetPin(IOMatrix::REVERSELIGHT)->Clear();
    }

    if(opmode==MOD_RUN)
    {
        IOMatrix::GetPin(IOMatrix::RUNINDICATION)->Set();
    }
    else
    {
        IOMatrix::GetPin(IOMatrix::RUNINDICATION)->Clear();
    }
       
    Param::SetFloat(Param::tmphs, selectedInverter->GetInverterTemperature()); //send inverter temp to web interface
    Param::SetFloat(Param::tempmotor, selectedInverter->GetMotorTemperature()); //send motor temp to web interface
    Param::SetFloat(Param::InvStat, selectedInverter->GetInverterState()); //update inverter status on web interface
    Param::SetFloat(Param::INVudc, selectedInverter->GetInverterVoltage()); //display inverter derived dc link voltage on web interface
       
    Param::SetInt(Param::T15Stat, selectedVehicle->Ready());
       
    int32_t IsaTemp=ISA::Temperature;
    Param::SetInt(Param::tmpaux,IsaTemp);
       
    if(targetChgint == chargeModeDC) selectedChargeInt->Task100Ms();// send the 100ms task request for the lim all the time and for others if in DC charge mode
       
    if(selectedChargeInt->DCFCRequest(runChg))//Request to run dc fast charge
    {
        //Here we receive a valid DCFC startup request.
        if(opmode != MOD_RUN) chargeMode = true;// set charge mode to true to bring up hv
        chargeModeDC = true;   //DC charge mode on
    }
    else if(chargeModeDC)
    {
        Param::SetInt(Param::chgtyp,OFF);
        chargeMode = false;  //no charge mode
        chargeModeDC = false;   //DC charge mode off
    }

    if(!chargeModeDC)//Request to run ac charge from the interface (e.g. LIM) if we are NOT in DC charge mode.
    {
        ACrequest=selectedChargeInt->ACRequest(runChg);
			  
    }
    Param::SetInt(Param::HeatReq,IOMatrix::GetPin(IOMatrix::HEATREQ)->Get());
}

static void ControlCabHeater(int opmode)
{
    //Only run heater in run mode
    //What about charge mode and timer mode?
    if (opmode == MOD_RUN && Param::GetInt(Param::Control) == 1)
    {
        IOMatrix::GetPin(IOMatrix::HEATERENABLE)->Set();//Heater enable and coolant pump on
        selectedHeater->SetTargetTemperature(50); //TODO: Currently does nothing
        selectedHeater->SetPower(Param::GetInt(Param::HeatPwr),Param::GetBool(Param::HeatReq));
    }
    else
    {
        IOMatrix::GetPin(IOMatrix::HEATERENABLE)->Clear(); //Disable heater and coolant pump
        selectedHeater->SetPower(0,0);
    }
}

static void Ms10Task(void)
{
    static uint32_t vehicleStartTime = 0;

    int16_t previousSpeed=Param::GetInt(Param::speed);
    int16_t speed = 0;
    float torquePercent;
    int opmode = Param::GetInt(Param::opmode);
    int stt = STAT_NONE;
    int requestedDirection = Param::GetInt(Param::dir);
    int rollingDirection = 0;

    dac_load_data_buffer_single(Param::GetInt(Param::DAC1), RIGHT12, CHANNEL_1);
    dac_software_trigger(CHANNEL_1);
    dac_load_data_buffer_single(Param::GetInt(Param::DAC2), RIGHT12, CHANNEL_2);
    dac_software_trigger(CHANNEL_2);
    
    ErrorMessage::SetTime(rtc_get_counter_val());
    
    selectedChargeInt->Task10Ms();
    
