royh99/Stm32f1-vcu/src/stm32_vcu_5_5_24.cpp
    if (Param::GetInt(Param::opmode) == MOD_RUN)
    {
        torquePercent = utils::ProcessThrottle(ABS(previousSpeed)); //run the throttle reading and checks and then generate Potnom/torquePercent

        //When requesting regen we need to be careful. If the car is not rolling
        //in the same direction as the selected gear, we will actually accelerate!
        //Exclude openinverter here because that has its own regen logic
      
	  //if (torquePercent < 0 && Param::GetInt(Param::Inverter) != InvModes::OpenI)
        if (torquePercent < 0)	    
        {
/*          if(Param::GetInt(Param::reversemotor) == 0)
            {
                rollingDirection = previousSpeed >= 0 ? 1 : -1;
            }
            else
            {
                rollingDirection = previousSpeed >= 0 ? -1 : 1;
            } */
			
            rollingDirection = Param::GetInt(Param::reversemotor) == 0 ? (previousSpeed >= 0 ? 1 : -1): (previousSpeed >= 0 ? -1 : 1);

            //When rolling backward while in forward gear, apply POSITIVE ( or negative if reversemotor = true) torque to slow down backward motion
            //Vice versa when in reverse gear and rolling forward.
            if (rollingDirection != requestedDirection)
            {
                torquePercent = -torquePercent;
            }
        }

        torquePercent *= requestedDirection; //torque requests invert when reverse direction is selected
        selectedInverter->Task10Ms();
    }
    else
    {
        torquePercent = 0;
        utils::displayThrottle();//just displays pot and pot2 when not in run mode to allow throttle cal
    }


    selectedInverter->SetTorque(torquePercent);

    //Brake light based on regen being below the set threshold
    if(torquePercent < Param::GetFloat(Param::RegenBrakeLight))
    {
        //enable Brake Light Ouput
        IOMatrix::GetPin(IOMatrix::BRAKELIGHT)->Set();
    }
    else
    {
        IOMatrix::GetPin(IOMatrix::BRAKELIGHT)->Clear();
    }

    //speed = ABS(selectedInverter->GetMotorSpeed());//set motor rpm on interface NO ABS allowed on speed as we need to know direction
    speed = selectedInverter->GetMotorSpeed();//set motor rpm on interface

    Param::SetInt(Param::speed, speed);
    utils::GetDigInputs(canInterface[Param::GetInt(Param::InverterCan)]);

    selectedVehicle->SetRevCounter(ABS(speed)); //ABS allowed here to keep number from rolling over.
    selectedVehicle->SetTemperatureGauge(Param::GetFloat(Param::tmphs));
    selectedVehicle->Task10Ms();
    //selectedDCDC->Task10Ms();
    //selectedShifter->Task10Ms();
    if(opmode==MOD_CHARGE) selectedCharger->Task10Ms();
    if(opmode==MOD_RUN) Param::SetInt(Param::canctr, (Param::GetInt(Param::canctr) + 1) & 0xF);//Update the OI can counter in RUN mode only

    //////////////////////////////////////////////////
    //            MODE CONTROL SECTION              //
    //////////////////////////////////////////////////
    float udc = utils::ProcessUdc(speed);
    //stt |= Param::GetInt(Param::pot) <= Param::GetInt(Param::potmin) ? STAT_NONE : STAT_POTPRESSED;
    stt |= Throttle::PotTest() == 0 ? STAT_NONE : STAT_POTPRESSED;
    stt |= udc >= Param::GetFloat(Param::udcsw) ? STAT_NONE : STAT_UDCBELOWUDCSW;
    stt |= udc < Param::GetFloat(Param::udclim) ? STAT_NONE : STAT_UDCLIM;
    Param::SetInt(Param::status, stt);
    
    switch (opmode)
    {
        case MOD_OFF:
        initbyStart=false;
        initbyCharge=false;
        DigIo::inv_out.Clear();//inverter power off
        DigIo::dcsw_out.Clear();
        IOMatrix::GetPin(IOMatrix::NEGCONTACTOR)->Clear();//Negative contactors off if used
        IOMatrix::GetPin(IOMatrix::COOLANTPUMP)->Clear();//Coolant pump off if used
        DigIo::prec_out.Clear();
        Param::SetInt(Param::dir, 0); // shift to park/neutral on shutdown regardless of shifter pos
        selectedVehicle->DashOff();
        startSig=false;//reset for next time
        if( !Throttle::PotTest() ) //check if throttle not pressed
        //if(Param::GetInt(Param::pot) < Param::GetInt(Param::potmin))
        {
            if ((selectedVehicle->Start() && selectedVehicle->Ready()))
            {
                startSig=true;
                opmode = MOD_PRECHARGE;//proceed to precharge if 1)throttle not pressed , 2)ign on , 3)start signal rx
                vehicleStartTime = rtc_get_counter_val();
                initbyStart=true;
            }
        }
        if(chargeMode)
        {
            opmode = MOD_PRECHARGE;//proceed to precharge if charge requested.
            vehicleStartTime = rtc_get_counter_val();
            initbyCharge=true;
        }
        Param::SetInt(Param::opmode, opmode);
        rlyDly=25;//Recharge sequence timer
        break;

        case MOD_PRECHARGE:
        if (!chargeMode)
        {
            DigIo::inv_out.Set();//inverter power on but not if we are in charge mode!
        }
        IOMatrix::GetPin(IOMatrix::NEGCONTACTOR)->Set();
        IOMatrix::GetPin(IOMatrix::COOLANTPUMP)->Set();
        if(rlyDly!=0) rlyDly--;//here we are going to pause before energising precharge to prevent too many contactors pulling amps at the same time
        if(rlyDly==0) DigIo::prec_out.Set();//commence precharge
        if ((stt & (STAT_POTPRESSED | STAT_UDCBELOWUDCSW | STAT_UDCLIM)) == STAT_NONE)
        {
            if(startSig)
            {
                opmode = MOD_RUN;
                startSig=false;//reset for next time
                rlyDly=25;//Recharge sequence timer
            }
            else if(chargeMode)
            {
                opmode = MOD_CHARGE;
                rlyDly=25;//Recharge sequence timer
            }
        }
        if(initbyCharge && !chargeMode) opmode = MOD_OFF;// These two statements catch a precharge hang from either start mode or run mode.
        if(initbyStart && !selectedVehicle->Ready()) opmode = MOD_OFF;
        if (udc < (Param::GetFloat(Param::udcsw)) && rtc_get_counter_val() > (vehicleStartTime + PRECHARGE_TIMEOUT))
        {
            DigIo::prec_out.Clear();
            ErrorMessage::Post(ERR_PRECHARGE);
            opmode = MOD_PRECHGFAIL;
        }
        Param::SetInt(Param::opmode, opmode);
        break;
        
        case MOD_PRECHGFAIL:
        startSig=false;
        DigIo::prec_out.Clear();
        if(initbyCharge && !chargeMode) opmode = MOD_OFF;//only go to off if the signal from charge or vehicle start is removed
        if(initbyStart && !selectedVehicle->Ready()) opmode = MOD_OFF;//this avoids oscillation in the event of a precharge system failure
        Param::SetInt(Param::opmode, opmode);
        break;
        
        case MOD_CHARGE:
        if(rlyDly!=0) rlyDly--;//pause before energising precharge to prevent too many contactors pulling amps at the same time
        if(rlyDly==0) DigIo::dcsw_out.Set();
        ErrorMessage::UnpostAll();
        if(!chargeMode) opmode = MOD_OFF;
        Param::SetInt(Param::opmode, opmode);
        break;
        
        case MOD_RUN:
        DigIo::led_gr.Set();
		DigIo::led_yl.Clear();
        if(rlyDly!=0) rlyDly--;//pause before energising precharge to prevent too many contactors pulling amps at the same time
        if(rlyDly==0) DigIo::dcsw_out.Set();
        Param::SetInt(Param::opmode, MOD_RUN);
        ErrorMessage::UnpostAll();
        if(!selectedVehicle->Ready())
        {
            opmode = MOD_OFF;
            DigIo::led_gr.Clear();
        }
        Param::SetInt(Param::opmode, opmode);
        break;
        
