royh99/Stm32f1-vcu/src/stm32_vcu_5_5_24.cpp
    }
    
    ControlCabHeater(opmode);
    if (Param::GetInt(Param::Type) == 1)  SBOX::ControlContactors(opmode,canInterface[Param::GetInt(Param::ShuntCan)]);//BMW contactor box
    //if (Param::GetInt(Param::Type) == 2)  VWBOX::ControlContactors(opmode,canInterface[Param::GetInt(Param::ShuntCan)]);//VW contactor box
    
}

static void Ms1Task(void)
{
    selectedInverter->Task1Ms();
    selectedVehicle->Task1Ms();
    selectedCharger->Task1Ms();
    selectedChargeInt->Task1Ms();
    //selectedDCDC->Task1Ms();
}

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
static void UpdateInv()
{
    selectedInverter->DeInit();
    switch (Param::GetInt(Param::Inverter))
    {
        case InvModes::Outlander:
        selectedInverter = &outlanderInv;
        break;
    }
    //This will call SetCanFilters() via the Clear Callback
    canInterface[0]->ClearUserMessages();
    canInterface[1]->ClearUserMessages();
}

static void UpdateVehicle()
{
    switch (Param::GetInt(Param::Vehicle))
    {
        case None:
        selectedVehicle = &novehicle;
        break;
              case LR:
        selectedVehicle = &lrVehicle;
        break;
    }
    //This will call SetCanFilters() via the Clear Callback
    canInterface[0]->ClearUserMessages();
    canInterface[1]->ClearUserMessages();
    
}

static void UpdateCharger()
{
    selectedCharger->DeInit();
    switch (Param::GetInt(Param::chargemodes))
    {
        case ChargeModes::Off:
        chargeMode = false;
        selectedCharger = &nochg;
        break;
        case ChargeModes::Out_lander:
        selectedCharger = &outChg;
        break;
        
    }
    //This will call SetCanFilters() via the Clear Callback
    canInterface[0]->ClearUserMessages();
    canInterface[1]->ClearUserMessages();
}

static void UpdateChargeInt()
{
    selectedChargeInt->DeInit();
    switch (Param::GetInt(Param::interface))
    {
        case ChargeInterfaces::Unused:
        selectedChargeInt = &UnUsed;
        break;
        case ChargeInterfaces::Chademo:
        selectedChargeInt = &chademoFC;
        break;
    }
    //This will call SetCanFilters() via the Clear Callback
    canInterface[0]->ClearUserMessages();
    canInterface[1]->ClearUserMessages();
}

static void UpdateHeater()
{
    selectedHeater->DeInit();
    switch (Param::GetInt(Param::Heater))
    {
        case HeatType::Noheater:
        selectedHeater = &Heaternone;
        break;
    }
    //This will call SetCanFilters() via the Clear Callback
    canInterface[0]->ClearUserMessages();
    canInterface[1]->ClearUserMessages();
}

static void UpdateBMS()
{
    selectedBMS->DeInit();
    switch (Param::GetInt(Param::BMS_Mode))
    {
        case BMSModes::BMSModeSimpBMS:
        selectedBMS = &BMSsimp;
        break;
        default:
        // Default to no BMS
        selectedBMS = &BMSnone;
        break;
    }
    //This will call SetCanFilters() via the Clear Callback
    canInterface[0]->ClearUserMessages();
    canInterface[1]->ClearUserMessages();
}

static void UpdateDCDC()
{
    selectedBMS->DeInit();
    switch (Param::GetInt(Param::DCdc_Type))
    {
        case DCDCModes::NoDCDC:
        selectedDCDC = &DCDCnone;
        break;
        case DCDCModes::OutlanderDCDC:
        selectedDCDC = &DCDCoutlander;
        break;
        
        default:
        // Default to no DCDC
        selectedDCDC = &DCDCnone;
        break;
    }
    //This will call SetCanFilters() via the Clear Callback
    canInterface[0]->ClearUserMessages();
    canInterface[1]->ClearUserMessages();
}


//Whenever the user clears mapped can messages or changes the
//CAN interface of a device, this will be called by the CanHardware module
static void SetCanFilters()
{
    CanHardware* inverter_can = canInterface[Param::GetInt(Param::InverterCan)];
    CanHardware* vehicle_can = canInterface[Param::GetInt(Param::VehicleCan)];
    CanHardware* shunt_can = canInterface[Param::GetInt(Param::ShuntCan)];
    CanHardware* charger_can = canInterface[Param::GetInt(Param::ChargerCan)];
    CanHardware* bms_can = canInterface[Param::GetInt(Param::BMSCan)];
    CanHardware* obd2_can = canInterface[Param::GetInt(Param::OBD2Can)];
    CanHardware* dcdc_can = canInterface[Param::GetInt(Param::DCDCCan)];
    
    selectedInverter->SetCanInterface(inverter_can);
    selectedVehicle->SetCanInterface(vehicle_can);
    selectedCharger->SetCanInterface(charger_can);
    selectedBMS->SetCanInterface(bms_can);
    selectedDCDC->SetCanInterface(dcdc_can);
    canOBD2.SetCanInterface(obd2_can);
    
    if (Param::GetInt(Param::Type) == 0)  ISA::RegisterCanMessages(shunt_can);//select isa shunt
    if (Param::GetInt(Param::Type) == 1)  SBOX::RegisterCanMessages(shunt_can);//select bmw sbox
    
    canInterface[1]->RegisterUserMessage(0x601); //CanSDO
    canInterface[0]->RegisterUserMessage(0x601); //CanSDO
}

void Param::Change(Param::PARAM_NUM paramNum)
{
    // This function is called when the user changes a parameter
    switch (paramNum)
    {
        case Param::Inverter:
        UpdateInv();
        break;
        case Param::Vehicle:
        UpdateVehicle();
        break;
        case Param::chargemodes:
        UpdateCharger();
        break;
        case Param::interface:
        UpdateChargeInt();
        break;
        case Param::Heater:
        UpdateHeater();
        break;
        case Param::BMS_Mode:
        UpdateBMS();
        break;
        case Param::DCdc_Type:
        UpdateDCDC();
        break;
        case Param::InverterCan:
        case Param::VehicleCan:
        case Param::ShuntCan:
        case Param::ChargerCan:
        canInterface[0]->ClearUserMessages();
        canInterface[1]->ClearUserMessages();
        break;
        default:
              break;
    }
           
