royh99/Stm32f1-vcu/src/stm32_vcu_5_5_24.cpp
    if(Param::GetInt(Param::reversemotor) != 0 && Param::GetInt(Param::Inverter) !=InvModes::Outlander)
    {
            Param::SetInt(Param::reversemotor, 0);  // only allow reversemotor for outlander
    }
       
    Throttle::potmin[0] = Param::GetInt(Param::potmin);
    Throttle::potmax[0] = Param::GetInt(Param::potmax);
    Throttle::potmin[1] = Param::GetInt(Param::pot2min);
    Throttle::potmax[1] = Param::GetInt(Param::pot2max);
    Throttle::regenRpm = Param::GetFloat(Param::regenrpm);
    Throttle::regenendRpm = Param::GetFloat(Param::regenendrpm);
    Throttle::throtRpmFilt = Param::GetFloat(Param::throtrpmfilt);
    if (Throttle::regenRpm < Throttle::regenendRpm)
    {
        Throttle::regenRpm = 1500;
        Throttle::regenendRpm = 100;
        Param::SetFloat(Param::regenrpm, 1500);
        Param::SetFloat(Param::regenendrpm, 100);
    }
    Throttle::regenmax = Param::GetFloat(Param::regenmax);
    Throttle::throtmax = Param::GetFloat(Param::throtmax);
    Throttle::throtmin = Param::GetFloat(Param::throtmin);
    Throttle::throtdead = Param::GetFloat(Param::throtdead);
    Throttle::idcmin = Param::GetFloat(Param::idcmin);
    Throttle::idcmax = Param::GetFloat(Param::idcmax);
    Throttle::udcmin = Param::GetFloat(Param::udcmin);
    Throttle::udcmax = Param::GetFloat(Param::udclim);
    Throttle::speedLimit = Param::GetInt(Param::revlim);
    Throttle::regenRamp = Param::GetFloat(Param::regenramp);
    Throttle::throttleRamp = Param::GetFloat(Param::throtramp);
    Throttle::throtmaxRev = Param::GetFloat(throtmaxRev);
    Throttle::regenBrake = Param::GetFloat(Param::regenBrake);
    targetCharger=static_cast<ChargeModes>(Param::GetInt(Param::chargemodes));//get charger setting from menu
    targetChgint=static_cast<ChargeInterfaces>(Param::GetInt(Param::interface));//get interface setting from menu
    if(chgSet==1)
    {
        seconds=Param::GetInt(Param::Set_Sec);//only update these params if charge command is set to disable
        minutes=Param::GetInt(Param::Set_Min);
        hours=Param::GetInt(Param::Set_Hour);
        days=Param::GetInt(Param::Set_Day);
        chgHrs_tmp=GetInt(Param::Chg_Hrs);
        chgMins_tmp=GetInt(Param::Chg_Min);
        chgDur_tmp=GetInt(Param::Chg_Dur);
    }
    chgSet = Param::GetInt(Param::Chgctrl);//0=enable,1=disable,2=timer.
    chgTicks = (GetInt(Param::Chg_Dur)*300);//number of 200ms ticks that equates to charge timer in minutes
    IOMatrix::AssignFromParams();
    IOMatrix::AssignFromParamsAnalogue();
}


static bool CanCallback(uint32_t id, uint32_t data[2], uint8_t dlc) //This is where we go when a defined CAN message is received.
{
    dlc = dlc;
    switch (id)
    {
    case 0x7DF:
        canOBD2.DecodeCAN(id,data);
        break;

    default:
        if (Param::GetInt(Param::Type) == 0)  ISA::DecodeCAN(id, data);
        if (Param::GetInt(Param::Type) == 1)  SBOX::DecodeCAN(id, data);
        //if (Param::GetInt(Param::Type) == 2)  VWBOX::DecodeCAN(id, data);
        selectedInverter->DecodeCAN(id, data);
        selectedVehicle->DecodeCAN(id, data);
        selectedCharger->DecodeCAN(id, data);
        selectedChargeInt->DecodeCAN(id, data);
        selectedBMS->DecodeCAN(id, (uint8_t*)data);
        selectedDCDC->DecodeCAN(id, (uint8_t*)data);
        //selectedShifter->DecodeCAN(id,data);
        break;
    }
    return false;
}


static void ConfigureVariantIO()
{
    ANA_IN_CONFIGURE(ANA_IN_LIST);
    DIG_IO_CONFIGURE(DIG_IO_LIST);

    AnaIn::Start();
    dac_setup();
}


extern "C" void tim4_isr(void)
{
    scheduler->Run();
}

extern "C" void rtc_isr(void)
{
    /* The interrupt flag isn't cleared by hardware, we have to do it. */
    rtc_clear_flag(RTC_SEC);
    
    if ( ++seconds >= 60 )
    {
        ++minutes;
        seconds -= 60;
    }
    if ( minutes >= 60 )
    {
        ++hours;
        minutes -= 60;
    }
    if ( hours >= 24 )
    {
        ++days;
        hours -= 24;
    }
}

extern "C" int main(void)
{    
    extern const TERM_CMD TermCmds[];
    
    clock_setup();
    rtc_setup();
    ConfigureVariantIO();
    //gpio_primary_remap(AFIO_MAPR_SWJ_CFG_JTAG_OFF_SW_ON, AFIO_MAPR_CAN2_REMAP | AFIO_MAPR_TIM1_REMAP_FULL_REMAP);//32f107
    gpio_primary_remap(AFIO_MAPR_SWJ_CFG_JTAG_OFF_SW_ON, AFIO_MAPR_TIM3_REMAP_FULL_REMAP);//disable JTAG, enable SWD, Remap tim3 to PC6, 7 , 8 ,9
       gpio_primary_remap(AFIO_MAPR_SWJ_CFG_JTAG_OFF_SW_ON, 0);//disable JTAG, enable SWD,
    nvic_setup();
    parm_load();
    tim3_setup(); //For general purpose PWM output
    Param::Change(Param::PARAM_LAST);
    DigIo::inv_out.Clear();//inverter power off during bootup
    
    Terminal t(USART3, TermCmds);
    Stm32Can c(CAN1, CanHardware::Baud500, false);
    Stm32Can c2(CAN2, CanHardware::Baud500, false);
    FunctionPointerCallback cb(CanCallback, SetCanFilters);
    Stm32Can *CanMapDev = &c;
    if (Param::GetInt(Param::CanMapCan) == 0)
    {
        CanMapDev = &c;
    }
    else
    {
        CanMapDev = &c2;
    }
    CanMap cm(CanMapDev);
    //CanMap cm(&c);
    CanSdo sdo(&c, &cm);
    sdo.SetNodeId(3);//id 3 for vcu?
    // Set up CAN 1 callback and messages to listen for
    canInterface[0] = &c;
    canInterface[1] = &c2;
    c.AddCallback(&cb);
    c2.AddCallback(&cb);
    TerminalCommands::SetCanMap(&cm);
    canMap = &cm;
    //canSdo = &sdo;
    CanHardware* shunt_can = canInterface[Param::GetInt(Param::ShuntCan)];
    
    canOBD2.SetCanInterface(canInterface[Param::GetInt(Param::OBD2Can)]);
    
    LinBus l(USART1, 19200);
    lin = &l;
    UpdateInv();
    UpdateVehicle();
    UpdateCharger();
    UpdateChargeInt();
    UpdateBMS();
    UpdateHeater();
    UpdateDCDC();
    
    Stm32Scheduler s(TIM4); //We never exit main so it's ok to put it on stack
    scheduler = &s;
    
    s.AddTask(Ms1Task, 1);
    s.AddTask(Ms10Task, 10);
    s.AddTask(Ms100Task, 100);
    s.AddTask(Ms200Task, 200);
    
    //if(Param::GetInt(Param::IsaInit)==1) ISA::initialize(shunt_can);//only call this once if a new sensor is fitted.
    
    Param::SetInt(Param::version, 4); //backward compatibility
    Param::SetInt(Param::opmode, MOD_OFF);//always off at startup

    while(1)
    {
        char c = 0;
        t.Run();
        if (sdo.GetPrintRequest() == PRINT_JSON)
        {
            TerminalCommands::PrintParamsJson(&sdo, &c);
        }
    }

    return 0;
}
